// 母音
const vowelTable = {
  "a": [1],
  "i": [1, 3],
  "u": [1, 2],
  "e": [1, 2, 3],
  "o": [2, 3]
};
// 子音
const consonantTable = {
  "k": [6],
  "s": [4, 6],
  "t": [4, 5],
  "n": [5],
  "h": [5, 6],
  "m": [4, 5, 6],
  "r": [4]
};
// その他
// 鉤括弧、丸括弧、棒線、点線については難しいので実装せず。
const otherTable = {
  "wa": [5],
  "wo": [4, 5],
  "nn": [4, 5, 6],
  "ya": [2, 5],
  "yu": [2, 5, 6],
  "yo": [2, 4, 5],
  "ltu": [3],
  "-": [3, 4],
  "。": [3, 4, 6],
  "？": [3, 6],
  "！": [3, 4, 5],
}
// 接頭辞
// ※濁拗音・半濁拗音は便宜上命名。
const prefixTable = {
  "dakuten": [4],
  "handakuten": [6],
  "suufu": [2, 4, 5, 6],
  "tunagifu": [5, 6],
  "gaijifu": [4, 6],
  "youonnfu": [2],
  "dakuyouonnfu": [2, 4],
  "handakuyouonnfu": [2, 6],
}
/*
const translateNumber = {
  "0": [2, 3, 4],
  "1": [1],
  "2": [1, 3],
  "3": [1, 2],
  "4": [1, 2, 4],
  "5": [1, 4],
  "6": [1, 2, 3],
  "7": [1, 2, 3, 4],
  "8": [1, 3, 4],
  "9": [2, 3]
}
*/
const romajiToHiraganaDicJSON = '{"-":"ー","~":"〜","z/":"・","z.":"…","z,":"‥","zh":"←","zj":"↓","zk":"↑","zl":"→","z-":"〜","z[":"『","z]":"』","[":"「","]":"」","va":"ゔぁ","vi":"ゔぃ","vu":"ゔ","ve":"ゔぇ","vo":"ゔぉ","vya":"ゔゃ","vyi":"ゔぃ","vyu":"ゔゅ","vye":"ゔぇ","vyo":"ゔょ","qq":"っ","vv":"っ","ll":"っ","xx":"っ","kk":"っ","gg":"っ","ss":"っ","zz":"っ","jj":"っ","tt":"っ","dd":"っ","hh":"っ","ff":"っ","bb":"っ","pp":"っ","mm":"っ","yy":"っ","rr":"っ","ww":"っ","www":"w","cc":"っ","kya":"きゃ","kyi":"きぃ","kyu":"きゅ","kye":"きぇ","kyo":"きょ","gya":"ぎゃ","gyi":"ぎぃ","gyu":"ぎゅ","gye":"ぎぇ","gyo":"ぎょ","sya":"しゃ","syi":"しぃ","syu":"しゅ","sye":"しぇ","syo":"しょ","sha":"しゃ","shi":"し","shu":"しゅ","she":"しぇ","sho":"しょ","zya":"じゃ","zyi":"じぃ","zyu":"じゅ","zye":"じぇ","zyo":"じょ","tya":"ちゃ","tyi":"ちぃ","tyu":"ちゅ","tye":"ちぇ","tyo":"ちょ","cha":"ちゃ","chi":"ち","chu":"ちゅ","che":"ちぇ","cho":"ちょ","cya":"ちゃ","cyi":"ちぃ","cyu":"ちゅ","cye":"ちぇ","cyo":"ちょ","dya":"ぢゃ","dyi":"ぢぃ","dyu":"ぢゅ","dye":"ぢぇ","dyo":"ぢょ","tsa":"つぁ","tsi":"つぃ","tse":"つぇ","tso":"つぉ","tha":"てゃ","thi":"てぃ","ti":"てぃ","thu":"てゅ","the":"てぇ","tho":"てょ","tyu":"てゅ","dha":"でゃ","dhi":"でぃ","di":"でぃ","dhu":"でゅ","dhe":"でぇ","dho":"でょ","dyu":"でゅ","twa":"とぁ","twi":"とぃ","twu":"とぅ","twe":"とぇ","two":"とぉ","tu":"とぅ","dwa":"どぁ","dwi":"どぃ","dwu":"どぅ","dwe":"どぇ","dwo":"どぉ","du":"どぅ","nya":"にゃ","nyi":"にぃ","nyu":"にゅ","nye":"にぇ","nyo":"にょ","hya":"ひゃ","hyi":"ひぃ","hyu":"ひゅ","hye":"ひぇ","hyo":"ひょ","bya":"びゃ","byi":"びぃ","byu":"びゅ","bye":"びぇ","byo":"びょ","pya":"ぴゃ","pyi":"ぴぃ","pyu":"ぴゅ","pye":"ぴぇ","pyo":"ぴょ","fa":"ふぁ","fi":"ふぃ","fu":"ふ","fe":"ふぇ","fo":"ふぉ","fya":"ふゃ","fyu":"ふゅ","fyo":"ふょ","hwa":"ふぁ","hwi":"ふぃ","hwe":"ふぇ","hwo":"ふぉ","hwyu":"ふゅ","mya":"みゃ","myi":"みぃ","myu":"みゅ","mye":"みぇ","myo":"みょ","rya":"りゃ","ryi":"りぃ","ryu":"りゅ","rye":"りぇ","ryo":"りょ","n":"ん","nn":"ん","n":"ん","xn":"ん","a":"あ","i":"い","u":"う","wu":"う","e":"え","o":"お","xa":"ぁ","xi":"ぃ","xu":"ぅ","xe":"ぇ","xo":"ぉ","la":"ぁ","li":"ぃ","lu":"ぅ","le":"ぇ","lo":"ぉ","lyi":"ぃ","xyi":"ぃ","lye":"ぇ","xye":"ぇ","ye":"いぇ","ka":"か","ki":"き","ku":"く","ke":"け","ko":"こ","xka":"ヵ","xke":"ヶ","lka":"ヵ","lke":"ヶ","ga":"が","gi":"ぎ","gu":"ぐ","ge":"げ","go":"ご","sa":"さ","si":"し","su":"す","se":"せ","so":"そ","ca":"か","ci":"し","cu":"く","ce":"せ","co":"こ","qa":"くぁ","qi":"くぃ","qu":"く","qe":"くぇ","qo":"くぉ","kwa":"くぁ","kwi":"くぃ","kwu":"くぅ","kwe":"くぇ","kwo":"くぉ","gwa":"ぐぁ","gwi":"ぐぃ","gwu":"ぐぅ","gwe":"ぐぇ","gwo":"ぐぉ","za":"ざ","zi":"じ","zu":"ず","ze":"ぜ","zo":"ぞ","ja":"じゃ","ji":"じ","ju":"じゅ","je":"じぇ","jo":"じょ","jya":"じゃ","jyi":"じぃ","jyu":"じゅ","jye":"じぇ","jyo":"じょ","ta":"た","ti":"ち","tu":"つ","tsu":"つ","te":"て","to":"と","da":"だ","di":"ぢ","du":"づ","de":"で","do":"ど","xtu":"っ","xtsu":"っ","ltu":"っ","ltsu":"っ","na":"な","ni":"に","nu":"ぬ","ne":"ね","no":"の","ha":"は","hi":"ひ","hu":"ふ","he":"へ","ho":"ほ","ba":"ば","bi":"び","bu":"ぶ","be":"べ","bo":"ぼ","pa":"ぱ","pi":"ぴ","pu":"ぷ","pe":"ぺ","po":"ぽ","ma":"ま","mi":"み","mu":"む","me":"め","mo":"も","xya":"ゃ","lya":"ゃ","ya":"や","wyi":"ゐ","xyu":"ゅ","lyu":"ゅ","yu":"ゆ","wye":"ゑ","xyo":"ょ","lyo":"ょ","yo":"よ","ra":"ら","ri":"り","ru":"る","re":"れ","ro":"ろ","xwa":"ゎ","lwa":"ゎ","wa":"わ","wi":"うぃ","we":"うぇ","wo":"を","wha":"うぁ","whi":"うぃ","whu":"う","whe":"うぇ","who":"うぉ",";":"ー","zd":"゛","zf":"゜","xd":"゙","xf":"゚","xku":"ㇰ","lku":"ㇰ","xsi":"ㇱ","xshi":"ㇱ","lsi":"ㇱ","lshi":"ㇱ","xsu":"ㇲ","lsu":"ㇲ","xto":"ㇳ","lto":"ㇳ","xnu":"ㇴ","lnu":"ㇴ","xha":"ㇵ","lha":"ㇵ","xhi":"ㇶ","lhi":"ㇶ","xhu":"ㇷ","lhu":"ㇷ","xpu":"ㇷ゚","lpu":"ㇷ゚","xhe":"ㇸ","lhe":"ㇸ","xho":"ㇹ","lho":"ㇹ","xmu":"ㇺ","lmu":"ㇺ","xra":"ㇻ","lra":"ㇻ","xri":"ㇼ","lri":"ㇼ","xru":"ㇽ","lru":"ㇽ","xre":"ㇾ","lre":"ㇾ","xro":"ㇿ","lro":"ㇿ"}';